tutorials/lagrangian/reactingParcelFoam/splashPanel/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2412                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

scale   0.1;

vertices
(
    //back
    ( 0   0   0)
    ( 1   0   0)
    ( 0  0.5  0)
    ( 1  0.5  0)

    // front
    ( 0   0   1)
    ( 1   0   1)
    ( 0  0.5  1)
    ( 1  0.5  1)
);

blocks
(
    hex (0 1 3 2 4 5 7 6 ) (20 10 20) simpleGrading (1 1 1)
);

edges
(
);

boundary
(
    sides
    {
        type patch;
        faces
        (
            (1 5 7 3)
            (4 5 7 6)
            (4 0 2 6)
            (7 3 2 6)
            (0 4 5 1)
        );
    }
    filmWalls
    {
        type wall;
        faces
        (
            (0 1 3 2)
        );
    }
);

mergePatchPairs
(
);

// ************************************************************************* //
